In [1]:
%pip install pandas

Requirement already satisfied: pandas in /Users/juliasabatel/opt/anaconda3/lib/python3.9/site-packages (1.4.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /Users/juliasabatel/opt/anaconda3/lib/python3.9/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /Users/juliasabatel/opt/anaconda3/lib/python3.9/site-packages (from pandas) (2021.3)
Requirement already satisfied: numpy>=1.18.5 in /Users/juliasabatel/opt/anaconda3/lib/python3.9/site-packages (from pandas) (1.21.5)
Requirement already satisfied: six>=1.5 in /Users/juliasabatel/opt/anaconda3/lib/python3.9/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

In [3]:
pd.set_option('display.max_columns', None)   # mostrar todas las columnas del df
#pd.set_option('display.max_rows', None)   # mostrar todas las filas del df

In [4]:
df_actor=pd.read_csv('data/actor.csv')

df_actor.head()

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33
1         2       NICK      WAHLBERG  2006-02-15 04:34:33
2         3         ED         CHASE  2006-02-15 04:34:33
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33

In [5]:
df_category=pd.read_csv('data/category.csv')
df_category.head()

   category_id       name          last_update
0            1     Action  2006-02-15 04:46:27
1            2  Animation  2006-02-15 04:46:27
2            3   Children  2006-02-15 04:46:27
3            4   Classics  2006-02-15 04:46:27
4            5     Comedy  2006-02-15 04:46:27

In [6]:
df_film=pd.read_csv('data/film.csv')
df_film.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,NaN,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,NaN,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,NaN,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

In [7]:
df_inventory=pd.read_csv('data/inventory.csv')
df_inventory.head()

   inventory_id  film_id  store_id          last_update
0             1        1         1  2006-02-15 05:09:17
1             2        1         1  2006-02-15 05:09:17
2             3        1         1  2006-02-15 05:09:17
3             4        1         1  2006-02-15 05:09:17
4             5        1         2  2006-02-15 05:09:17

In [8]:
df_language=pd.read_csv('data/language.csv')
df_language.head()

   language_id      name          last_update
0            1   English  2006-02-15 05:02:19
1            2   Italian  2006-02-15 05:02:19
2            3  Japanese  2006-02-15 05:02:19
3            4  Mandarin  2006-02-15 05:02:19
4            5    French  2006-02-15 05:02:19

In [9]:
df_old_HDD=pd.read_csv('data/old_HDD.csv')
df_old_HDD.head()

  first_name last_name                  title  release_year  category_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2   PENELOPE   GUINESS            ANGELS LIFE          2006           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4   PENELOPE   GUINESS          CHEAPER CLYDE          2006           14

In [10]:
df_rental=pd.read_csv('data/rental.csv')
df_rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [11]:
#CCOMENZAMOS EXPLORACIÓN

In [12]:
#Empezamos con la columna actor

df_actor.shape

(200, 4)

In [13]:
df_actor.info(memory_usage='deep') # no hay nulos

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   actor_id     200 non-null    int64
 1   first_name   200 non-null    object
 2   last_name    200 non-null    object
 3   last_update  200 non-null    object
dtypes: int64(1), object(3)
memory usage: 41.0 KB

In [14]:
df_actor.duplicated().any() #no hay duplicados

False

In [15]:
df_actor.head()

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33
1         2       NICK      WAHLBERG  2006-02-15 04:34:33
2         3         ED         CHASE  2006-02-15 04:34:33
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33

In [16]:
df_actor.last_update=pd.to_datetime(df_actor.last_update, format='%Y-%m-%d')
type(df_actor.last_update[0]) #para ponerlo como formato hora

pandas._libs.tslibs.timestamps.Timestamp

In [17]:
#comprobamos que esta correcto la hora
df_actor.info(memory_usage='deep') # no hay nulos #realmente no lo hemos usado porque la hemos eliminado, nos da el mismo valor todfo el rato
# y no aporta información

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   actor_id     200 non-null    int64
 1   first_name   200 non-null    object
 2   last_name    200 non-null    object
 3   last_update  200 non-null    datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(2)
memory usage: 27.8 KB

In [18]:
cols=['last_update']

df_actor.drop(columns=cols, inplace=True)

In [19]:
df_actor.head()

   actor_id first_name     last_name
0         1   PENELOPE       GUINESS
1         2       NICK      WAHLBERG
2         3         ED         CHASE
3         4   JENNIFER         DAVIS
4         5     JOHNNY  LOLLOBRIGIDA

In [20]:
df_actor[['first_name', 'last_name']] = df_actor[['first_name', 'last_name']].apply(lambda col: col.str.capitalize())
df_actor #Con esto dejamos todo en minuscula menos la primera letra

     actor_id first_name     last_name
0           1   Penelope       Guiness
1           2       Nick      Wahlberg
2           3         Ed         Chase
3           4   Jennifer         Davis
4           5     Johnny  Lollobrigida
..        ...        ...           ...
195       196       Bela        Walken
196       197      Reese          West
197       198       Mary        Keitel
198       199      Julia       Fawcett
199       200      Thora        Temple

[200 rows x 3 columns]

In [21]:
#df_actor[['first_name', 'last_name']] = df_actor[['first_name', 'last_name']].apply(lambda col: col.str.capitalize())
#df_actor

#esta funcion tambien sirve para ponerla todo en minuscula menos la primera

In [22]:
# df_category EXPLORACIÓN
df_category.head()

   category_id       name          last_update
0            1     Action  2006-02-15 04:46:27
1            2  Animation  2006-02-15 04:46:27
2            3   Children  2006-02-15 04:46:27
3            4   Classics  2006-02-15 04:46:27
4            5     Comedy  2006-02-15 04:46:27

In [23]:
df_category.info(memory_usage='deep') # no hay nulos

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   category_id  16 non-null     int64
 1   name         16 non-null     object
 2   last_update  16 non-null     object
dtypes: int64(1), object(2)
memory usage: 2.4 KB

In [24]:
#comprobamos si hay duplicados
df_category.duplicated().any() #no hay duplicados

False

In [25]:
#df_category.last_update=pd.to_datetime(df_category.last_update, format='%Y-%m-%d')
#type(df_actor.last_update[0]) #para ponerlo como formato hora

#no lo necesitamos porque vamos a eliminar la columna, no aport información y se repiten

In [26]:
df_category.info(memory_usage='deep') # no hay nulos

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   category_id  16 non-null     int64
 1   name         16 non-null     object
 2   last_update  16 non-null     object
dtypes: int64(1), object(2)
memory usage: 2.4 KB

In [27]:
cols2=['last_update']

df_category.drop(columns=cols2, inplace=True)

In [28]:
df_category #Sci-Fi esta bien escrito pero quizas nos traiga algun problema en el futuro

    category_id         name
0             1       Action
1             2    Animation
2             3     Children
3             4     Classics
4             5       Comedy
5             6  Documentary
6             7        Drama
7             8       Family
8             9      Foreign
9            10        Games
10           11       Horror
11           12        Music
12           13          New
13           14       Sci-Fi
14           15       Sports
15           16       Travel

In [29]:
## film EXPLORACIÓN
df_film.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,NaN,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,NaN,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,NaN,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

In [30]:
df_film[['title', 'description','special_features']] = df_film[['title', 'description','special_features']].apply(lambda col: col.str.capitalize())
df_film.head() #Con esto dejamos todo en minuscula menos la primera letra

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,Academy dinosaur,A epic drama of a feminist and a mad scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted scenes,behind the scenes",2006-02-15 05:03:42
1,2,Ace goldfinger,A astounding epistle of a database administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,deleted scenes",2006-02-15 05:03:42
2,3,Adaptation holes,A astounding reflection of a lumberjack and a ...,2006,1,NaN,7,2.99,50,18.99,NC-17,"Trailers,deleted scenes",2006-02-15 05:03:42
3,4,Affair prejudice,A fanciful documentary of a frisbee and a lumb...,2006,1,NaN,5,2.99,117,26.99,G,"Commentaries,behind the scenes",2006-02-15 05:03:42
4,5,African egg,A fast-paced documentary of a pastry chef and ...,2006,1,NaN,6,2.99,130,22.99,G,Deleted scenes,2006-02-15 05:03:42

In [31]:
#vamos a ver si tiene valores nulos
df_film.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   film_id               1000 non-null   int64
 1   title                 1000 non-null   object
 2   description           1000 non-null   object
 3   release_year          1000 non-null   int64
 4   language_id           1000 non-null   int64
 5   original_language_id  0 non-null      float64
 6   rental_duration       1000 non-null   int64
 7   rental_rate           1000 non-null   float64
 8   length                1000 non-null   int64
 9   replacement_cost      1000 non-null   float64
 10  rating                1000 non-null   object
 11  special_features      1000 non-null   object
 12  last_update           1000 non-null   object
dtypes: float64(3), int64(5), object(5)
memory usage: 495.3 KB

In [32]:
df_film.duplicated().any()

False

In [33]:
cols3=['last_update','release_year','original_language_id'] #hemos borrado las que no son relevante y se repite información

df_film.drop(columns=cols3, inplace=True)

In [34]:
df_film.head()

,film_id,title,description,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,1,Academy dinosaur,A epic drama of a feminist and a mad scientist...,1,6,0.99,86,20.99,PG,"Deleted scenes,behind the scenes"
1,2,Ace goldfinger,A astounding epistle of a database administrat...,1,3,4.99,48,12.99,G,"Trailers,deleted scenes"
2,3,Adaptation holes,A astounding reflection of a lumberjack and a ...,1,7,2.99,50,18.99,NC-17,"Trailers,deleted scenes"
3,4,Affair prejudice,A fanciful documentary of a frisbee and a lumb...,1,5,2.99,117,26.99,G,"Commentaries,behind the scenes"
4,5,African egg,A fast-paced documentary of a pastry chef and ...,1,6,2.99,130,22.99,G,Deleted scenes

In [35]:
#df_film.language_id.unique() esto lo hemos usado para ver los valores

In [36]:
df_film.info(memory_usage='deep') # no hay nulos

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   film_id           1000 non-null   int64
 1   title             1000 non-null   object
 2   description       1000 non-null   object
 3   language_id       1000 non-null   int64
 4   rental_duration   1000 non-null   int64
 5   rental_rate       1000 non-null   float64
 6   length            1000 non-null   int64
 7   replacement_cost  1000 non-null   float64
 8   rating            1000 non-null   object
 9   special_features  1000 non-null   object
dtypes: float64(2), int64(4), object(4)
memory usage: 405.5 KB

In [37]:
df_film.rating.unique() #esto lo hemos usado para ver los valores que hay dentro poque a simple vista parece que podria haber problema

array(['PG', 'G', 'NC-17', 'PG-13', 'R'], dtype=object)

In [38]:
#en principio no parece que haya problemas seguimos con la exploración

In [39]:
#inventory EXPLORACIÓN

In [40]:
df_inventory.head()

   inventory_id  film_id  store_id          last_update
0             1        1         1  2006-02-15 05:09:17
1             2        1         1  2006-02-15 05:09:17
2             3        1         1  2006-02-15 05:09:17
3             4        1         1  2006-02-15 05:09:17
4             5        1         2  2006-02-15 05:09:17

In [41]:
df_inventory.last_update.unique() #solo tenemos este valor que no aporta info, la eliminamos

array(['2006-02-15 05:09:17'], dtype=object)

In [42]:
df_inventory.store_id.unique() #la mantenemos

array([1, 2])

In [43]:
df_inventory.film_id.unique() #la mantenemos

array([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
        15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,  26,  27,
        28,  29,  30,  31,  32,  34,  35,  37,  39,  40,  42,  43,  44,
        45,  46,  47,  48,  49,  50,  51,  52,  53,  54,  55,  56,  57,
        58,  59,  60,  61,  62,  63,  64,  65,  66,  67,  68,  69,  70,
        71,  72,  73,  74,  75,  76,  77,  78,  79,  80,  81,  82,  83,
        84,  85,  86,  88,  89,  90,  91,  92,  93,  94,  95,  96,  97,
        98,  99, 100, 101, 102, 103, 104, 105, 106, 107, 109, 110, 111,
       112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124,
       125, 126, 127, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138,
       139, 140, 141, 142, 143, 145, 146, 147, 149, 150, 151, 152, 153,
       154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166,
       167, 168, 169, 170, 172, 173, 174, 175, 176, 177, 178, 179, 180,
       181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 193, 194,
       196, 197, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208, 209,
       210, 211, 212, 213, 214, 215, 216, 218, 219, 220, 222, 223])

In [44]:
cols4=['last_update']
df_inventory.drop(columns=cols4, inplace=True)

In [45]:
df_inventory.info(memory_usage='deep') # no hay nulos

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   inventory_id  1000 non-null   int64
 1   film_id       1000 non-null   int64
 2   store_id      1000 non-null   int64
dtypes: int64(3)
memory usage: 23.6 KB

In [46]:
df_inventory.head() #ya esta limpia

   inventory_id  film_id  store_id
0             1        1         1
1             2        1         1
2             3        1         1
3             4        1         1
4             5        1         2

In [47]:
# language EXPLORACIÓN

In [48]:
df_language

   language_id      name          last_update
0            1   English  2006-02-15 05:02:19
1            2   Italian  2006-02-15 05:02:19
2            3  Japanese  2006-02-15 05:02:19
3            4  Mandarin  2006-02-15 05:02:19
4            5    French  2006-02-15 05:02:19
5            6    German  2006-02-15 05:02:19

In [49]:
df_language.name #exploramos si estan correctamente escritos,etc

0     English
1     Italian
2    Japanese
3    Mandarin
4      French
5      German
Name: name, dtype: object

In [50]:
df_language.info(memory_usage='deep') # no hay nulos

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   language_id  6 non-null      int64
 1   name         6 non-null      object
 2   last_update  6 non-null      object
dtypes: int64(1), object(2)
memory usage: 1016.0 bytes

In [51]:
df_language.last_update.unique() #no nos aporta, la eliminamos

array(['2006-02-15 05:02:19'], dtype=object)

In [52]:
cols5=['last_update']
df_language.drop(columns=cols4, inplace=True)

In [53]:
df_language.head()

   language_id      name
0            1   English
1            2   Italian
2            3  Japanese
3            4  Mandarin
4            5    French

In [54]:
#old_HDD EXPLORACIÓN

In [55]:
df_old_HDD.head()

  first_name last_name                  title  release_year  category_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2   PENELOPE   GUINESS            ANGELS LIFE          2006           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4   PENELOPE   GUINESS          CHEAPER CLYDE          2006           14

In [56]:
df_old_HDD[['first_name', 'last_name','title']] = df_old_HDD[['first_name', 'last_name','title']].apply(lambda col: col.str.capitalize())
df_old_HDD.head() #corregimos las mayusculas

  first_name last_name                  title  release_year  category_id
0   Penelope   Guiness       Academy dinosaur          2006            6
1   Penelope   Guiness   Anaconda confessions          2006            2
2   Penelope   Guiness            Angels life          2006           13
3   Penelope   Guiness  Bulworth commandments          2006           10
4   Penelope   Guiness          Cheaper clyde          2006           14

In [57]:
cols6=['release_year']
df_old_HDD.drop(columns=cols6, inplace=True)

In [113]:
df_old_HDD['name'] = df_old_HDD.first_name + ' ' + df_old_HDD.last_name

In [114]:
col2 =['first_name','last_name']
df_old_HDD.drop(columns=col2, inplace=True)

In [117]:
df_old_HDD.head()

                   title  category_id              name
0       Academy dinosaur            6  Penelope Guiness
1   Anaconda confessions            2  Penelope Guiness
2            Angels life           13  Penelope Guiness
3  Bulworth commandments           10  Penelope Guiness
4          Cheaper clyde           14  Penelope Guiness

In [58]:
df_old_HDD.head() #eliminamos release_year porque no nos aporta información

  first_name last_name                  title  category_id
0   Penelope   Guiness       Academy dinosaur            6
1   Penelope   Guiness   Anaconda confessions            2
2   Penelope   Guiness            Angels life           13
3   Penelope   Guiness  Bulworth commandments           10
4   Penelope   Guiness          Cheaper clyde           14

In [97]:
df_old_HDD.info(memory_usage='deep') # no hay nulos

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   first_name   1000 non-null   object
 1   last_name    1000 non-null   object
 2   title        1000 non-null   object
 3   category_id  1000 non-null   int64
dtypes: int64(1), object(3)
memory usage: 199.8 KB

In [59]:
#rental EXPLORACIÓN

In [60]:
df_rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [ ]:
#vamos a corregir el nombre y apellido

In [106]:
df_actor['name'] = df_actor.first_name + ' ' + df_actor.last_name

In [109]:
col =['first_name','last_name']
df_actor.drop(columns=col, inplace=True)

In [111]:
df_actor.head()

   actor_id                 name
0         1     Penelope Guiness
1         2        Nick Wahlberg
2         3             Ed Chase
3         4       Jennifer Davis
4         5  Johnny Lollobrigida

In [61]:
cols7=['last_update']
df_rental.drop(columns=cols7, inplace=True)

In [62]:
df_rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1

In [63]:
df_rental.rental_date=pd.to_datetime(df_rental.rental_date, format='%Y-%m-%d')
type(df_rental.rental_date[0])

pandas._libs.tslibs.timestamps.Timestamp

In [64]:
df_rental.head() #para ver si sale todo en el formato correcto

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1

In [65]:
df_rental.return_date=pd.to_datetime(df_rental.return_date, format='%Y-%m-%d')
type(df_rental.return_date[0])

pandas._libs.tslibs.timestamps.Timestamp

In [66]:
df_rental.info(memory_usage='deep') # no hay nulos

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   rental_id     1000 non-null   int64
 1   rental_date   1000 non-null   datetime64[ns]
 2   inventory_id  1000 non-null   int64
 3   customer_id   1000 non-null   int64
 4   return_date   1000 non-null   datetime64[ns]
 5   staff_id      1000 non-null   int64
dtypes: datetime64[ns](2), int64(4)
memory usage: 47.0 KB

In [98]:
df_inventory.info(memory_usage='deep') # no hay nulos

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   inventory_id  1000 non-null   int64
 1   film_id       1000 non-null   int64
 2   store_id      1000 non-null   int64
dtypes: int64(3)
memory usage: 23.6 KB

In [99]:
df_actor.info(memory_usage='deep') # no hay nulos

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   actor_id    200 non-null    int64
 1   first_name  200 non-null    object
 2   last_name   200 non-null    object
dtypes: int64(1), object(2)
memory usage: 26.2 KB

In [100]:
df_film.info(memory_usage='deep') # no hay nulos

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   film_id           1000 non-null   int64
 1   title             1000 non-null   object
 2   description       1000 non-null   object
 3   language_id       1000 non-null   int64
 4   rental_duration   1000 non-null   int64
 5   rental_rate       1000 non-null   float64
 6   length            1000 non-null   int64
 7   replacement_cost  1000 non-null   float64
 8   rating            1000 non-null   object
 9   special_features  1000 non-null   object
dtypes: float64(2), int64(4), object(4)
memory usage: 405.5 KB

In [101]:
df_category.info(memory_usage='deep') # no hay nulos

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   category_id  16 non-null     int64
 1   name         16 non-null     object
dtypes: int64(1), object(1)
memory usage: 1.2 KB

In [102]:
df_rental.info(memory_usage='deep') # no hay nulos

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   rental_id     1000 non-null   int64
 1   rental_date   1000 non-null   datetime64[ns]
 2   inventory_id  1000 non-null   int64
 3   customer_id   1000 non-null   int64
 4   return_date   1000 non-null   datetime64[ns]
 5   staff_id      1000 non-null   int64
dtypes: datetime64[ns](2), int64(4)
memory usage: 47.0 KB

In [103]:
df_old_HDD.info(memory_usage='deep') # no hay nulos

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   first_name   1000 non-null   object
 1   last_name    1000 non-null   object
 2   title        1000 non-null   object
 3   category_id  1000 non-null   int64
dtypes: int64(1), object(3)
memory usage: 199.8 KB

In [67]:
#Exportamos a csv

In [68]:
df_actor.to_csv('data/actor_clean.csv', index=False)

In [69]:
df_category.to_csv('data/category_clean.csv', index=False)

In [70]:
df_film.to_csv('data/film_clean.csv', index=False)

In [71]:
df_inventory.to_csv('data/inventory_clean.csv', index=False)

In [72]:
df_language.to_csv('data/language_clean.csv', index=False)

In [73]:
df_old_HDD.to_csv('data/old_HDD_clean.csv', index=False)

In [74]:
df_rental.to_csv('data/rental_clean.csv', index=False)

In [75]:
# CREAR BASE DE DATOS NUEVA

In [76]:
%pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in /Users/juliasabatel/opt/anaconda3/lib/python3.9/site-packages (8.0.31)
Requirement already satisfied: protobuf<=3.20.1,>=3.11.0 in /Users/juliasabatel/opt/anaconda3/lib/python3.9/site-packages (from mysql-connector-python) (3.19.1)
Note: you may need to restart the kernel to use updated packages.

In [77]:
# crear base de datos nueva, antes ponemos la contraseña creando un txt y metiendo la contraseña dentro

#primero a sql y se crea

In [78]:
import mysql.connector as conn

In [79]:
%pip install SQLAlchemy
%pip install pymysql
%pip install mysql-connector-python #descargo y realizo todo. Esto es otra forma de hacerlo

Requirement already satisfied: SQLAlchemy in /Users/juliasabatel/opt/anaconda3/lib/python3.9/site-packages (1.4.32)
Requirement already satisfied: greenlet!=0.4.17 in /Users/juliasabatel/opt/anaconda3/lib/python3.9/site-packages (from SQLAlchemy) (1.1.1)
Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: pymysql in /Users/juliasabatel/opt/anaconda3/lib/python3.9/site-packages (1.0.2)
Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: mysql-connector-python in /Users/juliasabatel/opt/anaconda3/lib/python3.9/site-packages (8.0.31)
Requirement already satisfied: protobuf<=3.20.1,>=3.11.0 in /Users/juliasabatel/opt/anaconda3/lib/python3.9/site-packages (from mysql-connector-python) (3.19.1)
Note: you may need to restart the kernel to use updated packages.

In [80]:
from sqlalchemy import create_engine

In [ ]:
#vamos a subir primero los datos a sql y luego hacemos las relaciones

In [87]:
#lenguaje+driver://usuario:password@servidor:puerto/database

str_conn='mysql+pymysql://root:Porto moreclub21@localhost:3306/cinema'

cursor=create_engine(str_conn)

In [1]:
with open('contraseñas.txt', 'r') as file:
    pass_=file.readlines()
    print(pass_)

FileNotFoundError: [Errno 2] No such file or directory: 'contraseñas.txt'

In [118]:
df_actor.to_sql(name='actor', con=cursor, if_exists='replace', index=False)

200

In [119]:
df_category.to_sql(name='category', con=cursor, if_exists='replace', index=False)

16

In [120]:
df_film.to_sql(name='film', con=cursor, if_exists='replace', index=False)

1000

In [121]:
df_inventory.to_sql(name='inventory', con=cursor, if_exists='replace', index=False)

1000

In [122]:
df_language.to_sql(name='language', con=cursor, if_exists='replace', index=False)

6

In [126]:
df_old_HDD.to_sql(name='old_HDD', con=cursor, if_exists='replace', index=False)

1000

In [124]:
df_rental.to_sql(name='rental', con=cursor, if_exists='replace', index=False)

1000

In [125]:
#DE FORMA DIFERENTE

In [ ]:
#with open('password.txt', 'r') as file:
    #pass_=file.readlines()

In [ ]:
#password=''.join(pass_)

In [ ]:
# crear base de datos nueva
#conexion=conn.connect(host='localhost', user='root', passwd=password) # conexion al servidor
#cursor=conexion.cursor()
#cursor.execute('drop database if exists cine;')
#cursor.execute('create database cine;')